bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/Atmel.SAMC21_DFP.pdsc
<?xml version='1.0' encoding='ASCII'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Atmel</vendor>
   <url>http://packs.download.atmel.com/</url>
   <name>SAMC21_DFP</name>
   <description>Atmel SAMC21 Series Device Support</description>
   <releases>
      <release version="1.2.176" date="2018-12-18">Fix SVD. Added python programming and debugging scripts for MPLAB X.</release>
      <release version="1.1.144">Added ATSAMC21J15A.</release>
      <release version="1.1.104">Added ATSAMC21N17A and ATSAMC21N18A.</release>
      <release version="1.1.103">Removed warnings for some component and PIO headers. OSCCTRL fixes. </release>
      <release version="1.1.93">Added SAMC21JnAU. Fixed GNU/IAR assembler issues. Files now under Apache license.</release>
      <release version="1.0.44">Updated documentation links.</release>
      <release version="1.0.37">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Atmel</keyword>
      <keyword>Device Family Package Atmel</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAMC21</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAMC21" Dvendor="Atmel:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="ATSAMC21J15A">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU"/>
            <compile header="samc21/include/sam.h" define="__SAMC21J15A__"/>
            <debug svd="samc21/svd/ATSAMC21J15A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x8000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x400"/>
            <memory id="IRAM1" start="0x20000000" size="0x1000" default="1"/>
            <algorithm name="samc21/keil/Flash/ATSAMC_32.FLM" start="0x00000000" size="0x08000" default="1"/>
            <algorithm name="samc21/keil/Flash/ATSAMC_32_EEPROM.FLM" start="0x00400000" size="0x00400" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samc21/atdf/ATSAMC21J15A.atdf"/>
                  <at:variant ordercode="SAMC21J15A-MU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21J15A-MN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21J15A-MZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="SAMC21J15A-AU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21J15A-AN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21J15A-AZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x8000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x400" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x1000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samc21/edc/ATSAMC21J15A.PIC"/>
               </mchp:extension>
            </environment>
            <description>5V ARM Cortex-M0+ based microcontroller with 32KB Flash, 4KB SRAM, 48 MHz, five 16-bit timer/counters, DMA, six SERCOMs, two 12-bit ADC (20 unique channels), 10-bit DAC, 64 pins, dual CAN, LIN (master/slave), 16-bit Sigma Delta ADC</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMC21J15A" title="Device page for ATSAMC21J15A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMC21J15A" title="Datasheet"/>
         </device>
         <device Dname="ATSAMC21N17A">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU"/>
            <compile header="samc21n/include/sam.h" define="__SAMC21N17A__"/>
            <debug svd="samc21n/svd/ATSAMC21N17A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x20000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x1000"/>
            <memory id="IRAM1" start="0x20000000" size="0x4000" default="1"/>
            <algorithm name="samc21n/keil/Flash/ATSAMC_128.FLM" start="0x00000000" size="0x20000" default="1"/>
            <algorithm name="samc21n/keil/Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samc21n/atdf/ATSAMC21N17A.atdf"/>
                  <at:variant ordercode="SAMC21N17A-MN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21N17A-AN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samc21n/edc/ATSAMC21N17A.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMC21N17A" title="Device page for ATSAMC21N17A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMC21N17A" title="Datasheet"/>
         </device>
         <device Dname="ATSAMC21E15A">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU"/>
            <compile header="samc21/include/sam.h" define="__SAMC21E15A__"/>
            <debug svd="samc21/svd/ATSAMC21E15A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x8000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x400"/>
            <memory id="IRAM1" start="0x20000000" size="0x1000" default="1"/>
            <algorithm name="samc21/keil/Flash/ATSAMC_32.FLM" start="0x00000000" size="0x08000" default="1"/>
            <algorithm name="samc21/keil/Flash/ATSAMC_32_EEPROM.FLM" start="0x00400000" size="0x00400" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samc21/atdf/ATSAMC21E15A.atdf"/>
                  <at:variant ordercode="SAMC21E15A-MU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21E15A-MN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21E15A-MZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="SAMC21E15A-AU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21E15A-AN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21E15A-AZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x8000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x400" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x1000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samc21/edc/ATSAMC21E15A.PIC"/>
               </mchp:extension>
            </environment>
            <description>5V ARM Cortex-M0+ based microcontroller with 32KB Flash, 4KB SRAM, 48 MHz, three 16-bit timer/counters, DMA, four SERCOMs, two 12-bit ADC (10 channels), 10-bit DAC, 32 pins, CAN, LIN (master/slave), 16-bit Sigma Delta ADC</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMC21E15A" title="Device page for ATSAMC21E15A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMC21E15A" title="Datasheet"/>
         </device>
